pblfrnndmnr/control-bomba-isl1208-pic16-xc8/Control_BOMBA_RTC_ISL1208_V6.X/main.c
        // <editor-fold defaultstate="collapsed" desc="Graba datos">
        // <editor-fold defaultstate="collapsed" desc="Graba Nuevos datos en el RTC">
        //Graba Nuevos datos en el RC
        /////////////////////////////////////////////////
        if (bandera_graba_global) {
            if (bandera_graba_hora) {
                if (horario == &horarioactual) {
                    isl1208_set_time((*horario).hrs, (*horario).min, 00);
                    buzzer_on(10);
                }
                if (horario == &horarioenc) {
                    isl1208_set_time_enc((*horario).hrs, (*horario).min, 00);
                    //cuando grabo los datos quiero que toque el dia siguiente o en el mismo dia a la hora especificada
                    //por lo tanto desactivo la alarma por dow
                    //fechaenc.dow = (fecha.dow + periodoencendido + 1) % 7;
                    isl1208_set_dow_enc(0x00, 0);
                    buzzer_on(10);
                }
            }
            if (bandera_graba_fecha) {
                isl1208_set_date(&fecha.day, &fecha.month, &fecha.yr, &fecha.dow);
                buzzer_on(10);
            }
        }
        //Si no hay datos para grabar en hora y fecha actualizo la hora y la fecha del RTC
        if (actualizo_datos_rtc && bandera_graba_hora == 0 && bandera_graba_fecha == 0) {
            lee_y_transmite_date_and_time();
            isl1208_get_time_enc(&horarioenc.hrs, &horarioenc.min, &horarioenc.sec);
            isl1208_get_dow_enc(&fechaenc.dow);
            actualizo_datos_rtc = 0;
        }
        bandera_graba_hora = 0;
        bandera_graba_fecha = 0;
        //////////////////////////////////////////////////////////////////
        //Finaliza Graba Nuevos datos en el RTC
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Graba Nuevos datos en la EEPROM DEL PIC">
        //DIRECCION 0: periodoencendido(cada cuanto se enciende la bomba en automatico), de 0 a 6 dias,
        //DIRECCION 1: tiempoencendido (cuanto tiempo permanece encendida la bomba en automatico) 0 a 60 minutos
        //DIRECCION 2: usa_falla_de_corriente (dice si se usa falla de corriente o no)
        //DIRECCION 3: tiempofalla (cuanto tiempo puede estar en falla de corriente antes de apagar la bomba por seguridad) 0 a 10 segundos

        if (bandera_graba_global) {
            di();
            if (bandera_graba_periodoencendido) {
                eeprom_write(0, periodoencendido);
                buzzer_on(10);
            }
            if (bandera_graba_tiempoencendido) {
                eeprom_write(1, tiempoencendido);
                buzzer_on(10);
            }
            if (bandera_graba_usa_falla_de_corriente) {
                eeprom_write(2, usa_falla_de_corriente);
                buzzer_on(10);
            }
            if (bandera_graba_tiempofalla) {
                eeprom_write(3, tiempofalla);
                buzzer_on(10);
            }
            ei();
        }
        bandera_graba_global = 0;
        bandera_graba_periodoencendido = 0;
        bandera_graba_tiempoencendido = 0;
        bandera_graba_usa_falla_de_corriente = 0;
        bandera_graba_tiempofalla = 0;
        // </editor-fold>
        // </editor-fold>
        NOP();
        NOP();
    }
}

